# UpdaterInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UpdaterInfo Members
UpdaterInfo Class Methods Properties See Also
---
The UpdaterInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the UpdaterInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AdditionalInformation | Additional information about the updater. |
| ApplicationName | Name of the application that owns the updater. |
| IsOptional | Whether the updater is optional or not. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| UpdaterName | Name of the updater. |

# See Also
UpdaterInfo Class
Autodesk.Revit.DB Namespace